FOR THE AUTHORS GIVEN IN THE INPUT, GIVE THE ENTIRE NAME OF THE AUTHOR

Exemple 1:
Input : Musso
Output : Guillaume Musso

Exemple 2:
Input : Orwell
Output : George Orwell

WHEN YOU HAVE THE AUTHOR, USE THIS TEMPLATE TO CREATE A SPARQL QUERY:
```
SELECT ?book ?title
WHERE {
  ?book a dbo:Book .
  ?book dbo:author dbr:AUTHOR_NAME .
  ?book rdfs:label ?title .
  FILTER (lang(?title) = 'en')
}
LIMIT 50
```
REPLACE AUTHOR_NAME WITH THE AUTHOR, IN THE SPECIFIED FORMAT "FIRSTNAME_LASTNAME"

Exemple:
Erin Hunter will be replaced by Erin_Hunter
Stephen King will be replaced by Stephen_King
J.K. Rowling will be replaced by J.K._Rowling
George Orwell will be replaced by George_Orwell
Jane Austen will be replaced by Jane_Austen
Mark Twain will be replaced by Mark_Twain

Exemple 1 :
Input : Erin Hunter
Output :
SELECT ?book ?title
WHERE {
  ?book a dbo:Book .
  ?book dbo:author dbr:Erin_Hunter .
  ?book rdfs:label ?title .
  FILTER (lang(?title) = 'en')
}
LIMIT 50

Exemple 2 :
Input : George Orwell
Output :
SELECT ?book ?title
WHERE {
  ?book a dbo:Book .
  ?book dbo:author dbr:George_Orwell .
  ?book rdfs:label ?title .
  FILTER (lang(?title) = 'en')
}
LIMIT 50

DO NOT SEND THE IMPORTANT INFORMATION AND THE AUTHOR
ONLY SEND THE QUERY

+++++
{{$input}}
+++++