FIND THE AUTHOR RELATED TO THE PREFERENCES SPECIFIED IN THE input

Exemple 1:
INPUT : "I want a book related to Erin Hunter"
IMPORTANT INFORMATION : "Erin Hunter"

Example 2:
Input: "Can you recommend a mystery thriller by Agatha Christie?"
Important Information: "Agatha Christie"

Example 3:
Input: "I'd like to read something written by Stephen King."
Important Information: "Stephen King"

Example 4:
Input: "Do you have any recommendations from Jane Austen?"
Important Information: "Jane Austen"

Example 5:
Input: "Can you find a book by Mark Twain for me?"
Important Information: "Mark Twain"

Example 6:
Input: "I'm interested in novels authored by Haruki Murakami."
Important Information: "Haruki Murakami"

Example 7:
Input: "Any good reads by Neil Gaiman?"
Important Information: "Neil Gaiman"

Example 8:
Input: "Could you recommend something from Isaac Asimov?"
Important Information: "Isaac Asimov"

Example 9:
Input: "I'm looking for books by J.K. Rowling."
Important Information: "J.K. Rowling"

Example 10:
Input: "Can you suggest some works of George Orwell?"
Important Information: "George Orwell"

IF YOU FIND JUST A SURNAME, GIVE THE ENTIRE NAME OF THE AUTHOR

Exemple 1:
Input : Musso
Output : Guillaume Musso

Exemple 2:
Input : Orwell
Output : George Orwell

WHEN YOU HAVE THE AUTHOR, USE THIS TEMPLATE TO CREATE A SPARQL QUERY:
```
SELECT ?book ?title
WHERE {
  ?book a dbo:Book .
  ?book dbo:author dbr:AUTHOR_NAME .
  ?book rdfs:label ?title .
  FILTER (lang(?title) = 'en')
}
LIMIT 50
```
REPLACE AUTHOR_NAME WITH THE AUTHOR, IN THE SPECIFIED FORMAT "FIRSTNAME_LASTNAME"

Exemple:
Erin Hunter will be replaced by Erin_Hunter
Stephen King will be replaced by Stephen_King
J.K. Rowling will be replaced by J.K._Rowling
George Orwell will be replaced by George_Orwell
Jane Austen will be replaced by Jane_Austen
Mark Twain will be replaced by Mark_Twain

Exemple 1 :
Input : Erin Hunter
Output :
SELECT ?book ?title
WHERE {
  ?book a dbo:Book .
  ?book dbo:author dbr:Erin_Hunter .
  ?book rdfs:label ?title .
  FILTER (lang(?title) = 'en')
}
LIMIT 50

Exemple 2 :
Input : George Orwell
Output :
SELECT ?book ?title
WHERE {
  ?book a dbo:Book .
  ?book dbo:author dbr:George_Orwell .
  ?book rdfs:label ?title .
  FILTER (lang(?title) = 'en')
}
LIMIT 50

DO NOT SEND THE IMPORTANT INFORMATION AND THE AUTHOR
ONLY SEND THE QUERY

+++++
{{$input}}
+++++